{
  "name": "Remigijus Prialgauskis",
  "jobTitle": "Third-year Computer Science Student",
  "shortBio": "I create modern, attractive, and fast websites.",
  "socialMedia": {
    "mobileTitle": "You can find me on:"
  },
  "nav": {
    "about": "ABOUT",
    "experience": "EXPERIENCE",
    "projects": "PROJECTS"
  },
  "about": {
    "title": "About me",
    "paragraphs": {
      "0": "Hello! I'm a third-year computer science student, learning to create attractive and fast web applications.",
      "1": "I've worked with various technologies, but currently, I'm focusing on full-stack development using Nuxt (an extension of the Vue framework).",
      "2": "I'm always looking for opportunities to apply my skills to real-world problems and collaborate with like-minded developers.",
      "3": "During my studies, I gained additional experience by participating in Erasmus Blended Intensive Programs (BIPs) in Latvia and Germany.",
      "4": "I also recently completed a 3-month internship in Riga, Latvia, where I strengthened my practical skills in a professional environment.",
      "5": "When I'm not programming, I spend most of my free time at the computer watching various IT videos. I also enjoy watching anime, learning Japanese bit by bit, and playing computer games with friends."
    }
  },
  "builtWith": "Built using Nuxt and Tailwind CSS, hosted on Vercel. All text is set in the",
  "inter": "Inter",
  "typeface": "typeface.",
  "portfolioCredit": "",
  "experience": {
    "title": "Experience",
    "downloadResume": "Download CV",
    "resumeUrl": "/Remigijus-Prialgauskis-cv-en.pdf",
    "items": {
      "0": {
        "period": "2022 — PRESENT",
        "title": "Computer Science Student",
        "company": "KVK - Klaipėda State College",
        "link": "https://www.ku.lt/cris/entities/publication/6b727b31-a23f-4013-89a3-39f2ab7cb25c",
        "description": "During my studies, I worked with a variety of technologies, from creating websites and mobile applications using Android Studio to developing games using Godot Engine.",
        "detailedDescription": "First Year:\nI created two websites, one using HTML, CSS (Bootstrap), and JavaScript, and the other using PHP and Tailwind CSS. Additionally, together with two classmates, we developed a 3D Tetris game using Unity.\n\nSecond Year:\nTogether with two classmates, we created a website where users could view and post job advertisements, using the MERN technology stack. A scientific article was written for this project, and it was presented at the KVK Technology Conference. You can view this article by clicking on the link below.\n\nThe next project I worked on during the second year was my course project, where I tried the Nuxt framework with Tailwind CSS for the first time, and Node.js was used for the backend. I created a web application for an achievement evaluation system, where you can log in as a lecturer and perform CRUD operations on the tests created, which can be completed by logging in as a student.\n\nAnother important project in the second year was a mobile application created for a client from Vilnius using Android Studio. In a team of 5 students, we had to develop a mobile application within 2 months that would help users choose a smart home system based on a filled-out questionnaire and direct them to the appropriate suppliers who could install these desired services. Throughout the development, the Agile work methodology was used, and I was responsible for the role of Scrum Master and for the design and frontend of the mobile application.\n\nThird Year:\nCurrently studying.",
        "skills": "Figma, HTML, CSS, Bootstrap, Tailwind CSS, JavaScript, TypeScript, React, Vue, Nuxt, PHP, Java, Android Studio, Unity, Godot engine, Trello, Agile",
        "github": ""
      },
      "1": {
        "period": "MAY — JUL 2024",
        "title": "3-month internship in Latvia",
        "company": "Turiba University",
        "link": "https://scrolle.me",
        "description": "Three students from KVK completed this internship. We were tasked with creating a prototype of an LMS - Learning Management System, which would allow secure login for 5 different types of users. I was responsible for team leadership, project planning, design, and front-end development. We created the design ourselves, and I personally developed most of the front-end.",
        "detailedDescription": "Due to the project's scope, requirements, and time constraints, we created a minimal prototype, so a large part of the functionality wasn't completed. However, the available time was used effectively, and we learned many new things during this period.\n\nMore details are provided in the projects section below.",
        "skills": "Figma,Tailwind CSS,Nuxt,Node.js,MongoDB",
        "github": "https://github.com/RemiPR/Turiba-University-Erasmus-Project"
      },
      "2": {
        "period": "2022 — 2022",
        "title": "480-hour JavaScript full-stack internship",
        "company": "UAB Oigreat (formerly UAB Iverta)",
        "link": "https://www.iverta.eu/namai/",
        "description": "During this internship, I experimented with previously untried technologies, touched on server-side programming for the first time, and explored various frameworks and libraries. I created a single-page website based on a provided design mockup.",
        "detailedDescription": "",
        "skills": "HTML,CSS(Sass),JavaScript,TypeScript,React,Firebase DB,Node.js",
        "github": ""
      }
    }
  },
  "projects": {
    "title": "Projects",
    "items": {
      "0": {
        "title": "LMS - Learning Management System",
        "company": "3-month internship - Turiba University ",
        "link": "https://scrolle.me",
        "github": "https://github.com/RemiPR/Turiba-University-Erasmus-Project",
        "image": "/student-bg.webp",
        "images": "/student-bg.webp, /management-bg.webp, /guest-bg.webp, /guest-admission.webp, /teacher-groups.webp",
        "description": "Three students from KVK completed this internship. We were tasked with creating an LMS - Learning Management System, which would allow secure login for multiple types of users. I was responsible for team leadership, design, and front-end development. We created the design ourselves, and I personally developed most of the front-end.",
        "detailedDescription": "This ambitious project was developed by 3 students and one internship supervisor. The goal was to create a Learning Management System (LMS) that would be secure, user-friendly, and have core functionality similar to Moodle. This project aimed to address the contemporary issues of other learning management systems like Moodle, which are often overly complex, have too much unnecessary functionality, and aren't visually appealing.\n\nDue to the project's scope and time constraints, we created a minimal prototype, but the available time was used effectively, and we learned many new things during this period. The backend is currently disabled, so authorization doesn't work. All pages can be accessed directly by entering one of the desired user types in the URL: e.g., https://turiba-university-erasmus-project-remi-projects.vercel.app/guest, /student, /teacher, /management.\n\nP.S. Dark mode and language selection only work on some pages.",
        "skills": "Figma,Tailwind CSS,Nuxt,Node.js,MongoDB"
      },
      "1": {
        "title": "Smart Home Solutions",
        "company": "UAB Jung Vilnius",
        "link": "https://www.jung.de/lt/",
        "github": "https://github.com/H1X4Dev/KVK-Agile",
        "image": "/app-1.webp",
        "images": "/app-1.webp, /app-2.webp, /app-3.webp",
        "description": "This mobile app was developed by 5 students using Agile methodology. I was responsible for Scrum master duties, as well as the design and front-end of the mobile application.",
        "detailedDescription": "We used Kotlin through Android Studio to create this app. We adhered to the best programming practices learned during our studies (SOLID principles).\nThe app's purpose was to help users choose a smart home system based on a completed questionnaire and direct them to relevant suppliers who could install these desired services.",
        "skills": "Android Studio,Kotlin,Trello,Agile,Confluence"
      },
      "2": {
        "title": "Student Achievement Assessment System",
        "company": "KVK coursework",
        "link": "",
        "github": "",
        "image": "/assessment-system-3.webp",
        "images": "/assessment-system-3.webp, /assessment-system-1.webp, /assessment-system-2.webp",
        "description": "I developed this coursework independently, experimenting with the Nuxt framework and Tailwind CSS for the first time, while using Node.js for the back-end. I created a web application for an achievement assessment system where users can log in as teachers to perform CRUD operations on created tests, which can then be taken by users logged in as students.",
        "detailedDescription": "In this assessment system, tests from the database are displayed, which can be created/modified/deleted by logged-in teachers. There's also a filtering functionality that allows sorting tests by groups, number of questions, time limit, etc.",
        "skills": "Nuxt,Tailwind CSS,Node.js,MongoDB"
      },
      "3": {
        "title": "Job Board Portal",
        "company": "KVK project work",
        "link": "",
        "github": "",
        "image": "/job-portal-1.webp",
        "images": "/job-portal-1.webp, /job-portal-2.webp, /job-portal-3.webp",
        "description": "I developed this project with two colleagues, using the MERN architecture for the first time. A scientific paper about this project was presented at the KVK technology conference, which you can find by clicking on the link that will be visible when you click on this project card.",
        "detailedDescription": "",
        "skills": "React,Tailwind CSS,Node.js,MongoDB"
      },
      "4": {
        "title": "Auto Service AutoKorega",
        "company": "AutoKorega",
        "link": "https://autokorega.lt/",
        "github": "",
        "image": "/autokorega-1.webp",
        "images": "/autokorega-1.webp, /autokorega-2.webp, /autokorega-3.webp",
        "description": "This project was created by three first-year students for a client from Klaipėda. We designed the idea in Figma, made the client's requested changes, and developed a website using the WordPress SeedProd builder plugin based on this design. This website provides information about the auto service's offered services and contact details.",
        "detailedDescription": "This project was created by three first-year students for a client from Klaipėda. We designed the idea in Figma, made the client's requested changes, and developed a website using the WordPress SeedProd builder plugin based on this design.\n\nThe website provides information about the auto service's offered services and contact details.\n\nI was responsible for the team leader role, ensuring that the entire team completed their tasks with quality.",
        "skills": "WordPress, SeedProd builder, HTML, CSS, JavaScript, Figma"
      }
    }
  },
  "theme": "light",
  "loading": "Loading...",
  "modal": {
    "about": "Detailed description",
    "technologies": "Technologies used",
    "website": "Website",
    "close": "Close",
    "imgCounter": "of"
  },
  "contactForm": {
    "contact": "Contact",
    "name": "Name",
    "email": "Email",
    "message": "Your message",
    "submit": "Send",
    "submitSuccess": "Your message has been sent successfully!",
    "submitError": "An error occurred, please try again.",
    "mobileTitle": "Or you can leave your message here:",
    "validation": {
      "name": {
        "required": "Please enter your name",
        "min": "Name is too short",
        "max": "Name is too long",
        "onlyLetters": "Name can only contain letters"
      },
      "email": {
        "invalid": "Invalid email format",
        "required": "Email is required",
        "max": "Email is too long"
      },
      "message": {
        "required": "Message is required",
        "min": "Message is too short",
        "max": "Message is too long"
      }
    }
  },
  "meta": {
    "title": "Remigijus Prialgauskis | Web Developer",
    "description": "Professional portfolio of Remigijus Prialgauskis, showcasing web development projects and skills in Nuxt, Figma, MongoDB, and many others."
  },
  "pages": {
    "home": "Home",
    "projects": "Projects",
    "contact": "Contact"
  }
}
